; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)
  (:functions 	(time-to-walk ?l1 ?l2 - location)
		(time-to-drive ?l1 ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-3-2-4-150)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p5-0 - location
	p5-6 - location
	p1-0 - location
	p1-2 - location
	p1-4 - location
	p3-0 - location
	p3-1 - location
	p4-6 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s6)
	(at driver3 s4)
	(at truck1 s1)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s6)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at package1 s1)
	(at package2 s0)
	(at package3 s0)
	(at package4 s1)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(= (time-to-walk s5 p5-0) 4)
	(= (time-to-walk p5-0 s5) 4)
	(= (time-to-walk s0 p5-0) 6)
	(= (time-to-walk p5-0 s0) 6)
	(path s5 p5-6)
	(path p5-6 s5)
	(path s6 p5-6)
	(path p5-6 s6)
	(= (time-to-walk s5 p5-6) 19)
	(= (time-to-walk p5-6 s5) 19)
	(= (time-to-walk s6 p5-6) 8)
	(= (time-to-walk p5-6 s6) 8)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(= (time-to-walk s1 p1-0) 9)
	(= (time-to-walk p1-0 s1) 9)
	(= (time-to-walk s0 p1-0) 26)
	(= (time-to-walk p1-0 s0) 26)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(= (time-to-walk s1 p1-2) 21)
	(= (time-to-walk p1-2 s1) 21)
	(= (time-to-walk s2 p1-2) 24)
	(= (time-to-walk p1-2 s2) 24)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(= (time-to-walk s1 p1-4) 5)
	(= (time-to-walk p1-4 s1) 5)
	(= (time-to-walk s4 p1-4) 3)
	(= (time-to-walk p1-4 s4) 3)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(= (time-to-walk s3 p3-0) 3)
	(= (time-to-walk p3-0 s3) 3)
	(= (time-to-walk s0 p3-0) 14)
	(= (time-to-walk p3-0 s0) 14)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(= (time-to-walk s3 p3-1) 10)
	(= (time-to-walk p3-1 s3) 10)
	(= (time-to-walk s1 p3-1) 15)
	(= (time-to-walk p3-1 s1) 15)
	(path s4 p4-6)
	(path p4-6 s4)
	(path s6 p4-6)
	(path p4-6 s6)
	(= (time-to-walk s4 p4-6) 14)
	(= (time-to-walk p4-6 s4) 14)
	(= (time-to-walk s6 p4-6) 21)
	(= (time-to-walk p4-6 s6) 21)
	(link s1 s5)
	(link s5 s1)
	(= (time-to-drive s1 s5) 11)
	(= (time-to-drive s5 s1) 11)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 8)
	(= (time-to-drive s0 s3) 8)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 3)
	(= (time-to-drive s1 s3) 3)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 24)
	(= (time-to-drive s2 s3) 24)
	(link s5 s3)
	(link s3 s5)
	(= (time-to-drive s5 s3) 26)
	(= (time-to-drive s3 s5) 26)
	(link s5 s4)
	(link s4 s5)
	(= (time-to-drive s5 s4) 10)
	(= (time-to-drive s4 s5) 10)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 3)
	(= (time-to-drive s1 s0) 3)
	(link s0 s5)
	(link s5 s0)
	(= (time-to-drive s0 s5) 13)
	(= (time-to-drive s5 s0) 13)
	(link s0 s6)
	(link s6 s0)
	(= (time-to-drive s0 s6) 13)
	(= (time-to-drive s6 s0) 13)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 19)
	(= (time-to-drive s1 s2) 19)
	(link s2 s5)
	(link s5 s2)
	(= (time-to-drive s2 s5) 4)
	(= (time-to-drive s5 s2) 4)
	(link s6 s3)
	(link s3 s6)
	(= (time-to-drive s6 s3) 6)
	(= (time-to-drive s3 s6) 6)
	(link s6 s4)
	(link s4 s6)
	(= (time-to-drive s6 s4) 7)
	(= (time-to-drive s4 s6) 7)
	(link s6 s5)
	(link s5 s6)
	(= (time-to-drive s6 s5) 17)
	(= (time-to-drive s5 s6) 17)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 6)
	(= (time-to-drive s0 s4) 6)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 13)
	(= (time-to-drive s1 s4) 13)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 19)
	(= (time-to-drive s2 s4) 19)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver2 s3)
	(at driver3 s1)
	(at truck1 s2)
	(at truck2 s1)
	(at package1 s6)
	(at package2 s1)
	(at package3 s3)
	(at package4 s6)
	))

(:metric minimize (+ (* 4 (total-time)) (* 1 (fuel-used))))

)

; plan
1. (walk driver3 s4 p1-4)
   deleted: (at driver3 s4)
   added: (at driver3 p1-4)
   goals met: 0 of 8
2. (board-truck driver2 truck2 s6)
   deleted: (at driver2 s6) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 0 of 8
3. (drive-truck truck2 s6 s3 driver2)
   deleted: (at truck2 s6)
   added: (at truck2 s3)
   changed: (fuel-used) from 0 to 60
   goals met: 0 of 8
4. (walk driver3 p1-4 s1)
   deleted: (at driver3 p1-4)
   added: (at driver3 s1)
   goals met: 1 of 8
5. (drive-truck truck2 s3 s0 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   changed: (fuel-used) from 60 to 140
   goals met: 1 of 8
6. (load-truck package2 truck2 s0)
   deleted: (at package2 s0)
   added: (in package2 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 1 of 8
7. (load-truck package3 truck2 s0)
   deleted: (at package3 s0)
   added: (in package3 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 1 of 8
8. (drive-truck truck2 s0 s3 driver2)
   deleted: (at truck2 s0)
   added: (at truck2 s3)
   changed: (fuel-used) from 140 to 244
   goals met: 1 of 8
9. (unload-truck package3 truck2 s3)
   deleted: (in package3 truck2)
   added: (at package3 s3)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 2 of 8
10. (drive-truck truck2 s3 s1 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s1)
   changed: (fuel-used) from 244 to 277
   goals met: 3 of 8
11. (unload-truck package2 truck2 s1)
   deleted: (in package2 truck2)
   added: (at package2 s1)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 4 of 8
12. (load-truck package1 truck2 s1)
   deleted: (at package1 s1)
   added: (in package1 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 4 of 8
13. (load-truck package4 truck2 s1)
   deleted: (at package4 s1)
   added: (in package4 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 4 of 8
14. (drive-truck truck2 s1 s3 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s3)
   changed: (fuel-used) from 277 to 316
   goals met: 3 of 8
15. (drive-truck truck2 s3 s6 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s6)
   changed: (fuel-used) from 316 to 394
   goals met: 3 of 8
16. (unload-truck package1 truck2 s6)
   deleted: (in package1 truck2)
   added: (at package1 s6)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 4 of 8
17. (unload-truck package4 truck2 s6)
   deleted: (in package4 truck2)
   added: (at package4 s6)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 5 of 8
18. (board-truck driver3 truck1 s1)
   deleted: (at driver3 s1) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 4 of 8
19. (drive-truck truck2 s6 s4 driver2)
   deleted: (at truck2 s6)
   added: (at truck2 s4)
   changed: (fuel-used) from 394 to 464
   goals met: 4 of 8
20. (disembark-truck driver2 truck2 s4)
   deleted: (driving driver2 truck2)
   added: (at driver2 s4) (empty truck2)
   goals met: 4 of 8
21. (drive-truck truck1 s1 s2 driver3)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   changed: (fuel-used) from 464 to 654
   goals met: 5 of 8
22. (disembark-truck driver3 truck1 s2)
   deleted: (driving driver3 truck1)
   added: (at driver3 s2) (empty truck1)
   goals met: 5 of 8
23. (walk driver3 s2 p1-2)
   deleted: (at driver3 s2)
   added: (at driver3 p1-2)
   goals met: 5 of 8
24. (walk driver2 s4 p1-4)
   deleted: (at driver2 s4)
   added: (at driver2 p1-4)
   goals met: 5 of 8
25. (walk driver3 p1-2 s1)
   deleted: (at driver3 p1-2)
   added: (at driver3 s1)
   goals met: 6 of 8
26. (walk driver2 p1-4 s1)
   deleted: (at driver2 p1-4)
   added: (at driver2 s1)
   goals met: 6 of 8
27. (walk driver2 s1 p3-1)
   deleted: (at driver2 s1)
   added: (at driver2 p3-1)
   goals met: 6 of 8
28. (walk driver2 p3-1 s3)
   deleted: (at driver2 p3-1)
   added: (at driver2 s3)
   goals met: 7 of 8
29. (walk driver3 s1 p1-4)
   deleted: (at driver3 s1)
   added: (at driver3 p1-4)
   goals met: 6 of 8
30. (walk driver3 p1-4 s4)
   deleted: (at driver3 p1-4)
   added: (at driver3 s4)
   goals met: 6 of 8
31. (board-truck driver3 truck2 s4)
   deleted: (at driver3 s4) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 6 of 8
32. (drive-truck truck2 s4 s1 driver3)
   deleted: (at truck2 s4)
   added: (at truck2 s1)
   changed: (fuel-used) from 654 to 784
   goals met: 7 of 8
33. (disembark-truck driver3 truck2 s1)
   deleted: (driving driver3 truck2)
   added: (at driver3 s1) (empty truck2)
   goals met: 8 of 8
